{
  "architectures": [
    "ApertusForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "dtype": "bfloat16",
  "eos_token_id": 2,
  "hidden_act": "xielu",
  "hidden_dropout": 0.0,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "max_position_embeddings": 16384,
  "mlp_bias": false,
  "model_type": "apertus",
  "num_attention_heads": 16,
  "num_hidden_layers": 12,
  "num_key_value_heads": 4,
  "pad_token_id": 3,
  "post_norm": false,
  "qk_norm": false,
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "factor": 32.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_theta": 500000,
    "rope_type": "llama3",
    "type": "llama3"
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": true,
  "vocab_size": 266496,
  "auto_map": {
    "AutoConfig": "configuration_apertus.ApertusConfig",
    "AutoModelForCausalLM": "modeling_apertus.ApertusForCausalLM"
  },
  "trust_remote_code": true
}